# Terraform `environment` `prod`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.rbac.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.key_vault.data.azurerm_client_config.current: Reading...
data.azurerm_user_assigned_identity.admin: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.postgres: Reading...
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001prod/subnets/Postgres]
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.default: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wM2UwZWQzYi04NDQ3LTQyMGEtOTQyOS01NWU4MTNjNjRiMDU7b2JqZWN0SWQ9YTk1ODVhNjQtMjBmMC00ZDE4LWFiYTYtOTkzMGY5MmI4MDljO3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.spoke: Reading...
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001prod]
module.rbac.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001prod/subnets/Default]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod]
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001prod]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_resource_group.spoke: Read complete after 0s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["8a86d76e-91b1-4e47-a411-e81f8e689882"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod]
module.rbac_platform_app["e7e7ed66-8178-4737-8196-0b2604811939"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001prod/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001prod"
      + name                    = "db-psqlsrvaltinnauthregister001prod-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001prod"
      + name                    = "db-psqlsrvaltinnauthregister001prod-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database is tainted, so must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "259770312045536083" -> (known after apply)
      ~ triggers = {
          ~ "ts" = "2026-01-13T15:47:14Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.labels_vault_references["prod-register|Altinn:Npgsql:register:ConnectionString"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "labels_vault_references" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Altinn:Npgsql:register:ConnectionString?label=prod-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001prod.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001prod-register-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.labels_vault_references["prod-register|Altinn:Npgsql:register:Migrate:ConnectionString"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "labels_vault_references" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Altinn:Npgsql:register:Migrate:ConnectionString?label=prod-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001prod.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001prod-register-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauthregister001prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001prod"
        name                              = "psqlsrvaltinnauthregister001prod"
        tags                              = {}
        # (20 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2026-01-13T15:45:47Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @andreasisnes |
| Action | `workflow_dispatch` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/prod/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_prod_altinn.register.tfstate.tfplan` |